# Math Operations

## Operations in Columns

In [3]:
import numpy as np
import pandas as pd

In [4]:
#Reading the csv file
df_exam = pd.read_csv('StudentsPerformance.csv')

In [5]:
df_exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [6]:
# Select a column and calculate total sum
df_exam['math score'].sum()

np.int64(66089)

In [11]:
#count,std, mean, min, max
df_exam['math score'].count()
df_exam['math score'].std()
df_exam['math score'].mean()
df_exam['math score'].min()
df_exam['math score'].max()

np.int64(100)

In [12]:
#Easier calculation with .describe()
df_exam['math score'].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [13]:
df_exam.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

## Operations in Rows

In [14]:
#Calculating the sum in a row
df_exam['math score'] + df_exam['reading score'] + df_exam['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [15]:
# creating an average and adding into the new column
df_exam['average']= (df_exam['math score'] + df_exam['reading score'] + df_exam['writing score'])/3

In [17]:
#Showing the dataframe
df_exam.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

# Value Counts

In [18]:
#Counting gender elements
df_exam['gender'].count()

np.int64(1000)

In [19]:
#counting gender elements by category
df_exam['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [21]:
#return the relative frequency(divide all values by sum of the values)
df_exam['gender'].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [22]:
#Counting Parental level of education  elements by category
df_exam['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [24]:
#return the relative frequency
df_exam['parental level of education'].value_counts(normalize=True).round(2)

parental level of education
some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: proportion, dtype: float64